chemary/nrf52_ble_long_range/peripheral_long_range_demo_kit/main.c
/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data ={
    .adv_data = {
        .p_data = m_enc_advdata,
        .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data = {
        .p_data = NULL,
        .len = 0,
    }
};

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current BLE connection .*/
static uint8_t m_gap_role = BLE_GAP_ROLE_INVALID;        /**< BLE role for this connection, see @ref BLE_GAP_ROLES */

// Connection parameters requested for connection.
static ble_gap_conn_params_t m_conn_param = {
    .min_conn_interval = CONN_INTERVAL_MIN, // Minimum connection interval.
    .max_conn_interval = CONN_INTERVAL_MAX, // Maximum connection interval.
    .slave_latency = SLAVE_LATENCY,         // Slave latency.
    .conn_sup_timeout = CONN_SUP_TIMEOUT    // Supervisory timeout.
};

static int8_t vbatt[2]; // Variable to hold voltage reading
static int8_t temp[4];  // variable to hold temp reading

static void non_conn_adv_fast_blink_timeout_handler(void *p_context) {
    UNUSED_PARAMETER(p_context);
    bsp_board_led_invert(NON_CONN_ADV_LED);
}

static void conn_adv_fast_blink_timeout_handler(void *p_context) {
    UNUSED_PARAMETER(p_context);
    bsp_board_led_invert(CONN_ADV_CONN_STATE_LED);
}

static void led_1Mbps_slow_blink_timeout_handler(void *p_context) {
    UNUSED_PARAMETER(p_context);
    bsp_board_led_invert(PHY_SELECTION_LED);
}

static void led_8dBm_slow_blink_timeout_handler(void *p_context) {
    UNUSED_PARAMETER(p_context);
    bsp_board_led_invert(OUTPUT_POWER_SELECTION_LED);
}

static void advdata_update_handler(void *p_context) {
    UNUSED_PARAMETER(p_context);
    disconnect_stop_adv();
    advdata_update();
    advertising_start();
}

/**@brief Function for handling BLE_GAP_EVT_CONNECTED events.
 * Save the connection handle and GAP role.
 * Turn on the "connected state" LED.
 */
static void on_ble_gap_evt_connected(ble_gap_evt_t const *p_gap_evt) {
    ret_code_t err_code;

    m_conn_handle = p_gap_evt->conn_handle;
    m_gap_role = p_gap_evt->params.connected.role;

    err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, m_output_power_selected);
    APP_ERROR_CHECK(err_code);

    if (m_gap_role == BLE_GAP_ROLE_PERIPH) {
        NRF_LOG_INFO("Connected as a peripheral.");
    } else if (m_gap_role == BLE_GAP_ROLE_CENTRAL) {
        NRF_LOG_INFO("Connected as a central. Should not happen.");
    }

    //If advertising, stop advertising.
    (void)sd_ble_gap_adv_stop(m_adv_handle);

    // Stop advertising LED timer, turn on "connected state" LED
    err_code = app_timer_stop(m_conn_adv_fast_blink_timer_id);
    APP_ERROR_CHECK(err_code);
    bsp_board_led_on(CONN_ADV_CONN_STATE_LED);
}

/**@brief Function for handling BLE_GAP_EVT_DISCONNECTED events.
 * Unset the connection handle and restart advertising if needed.
 */
static void on_ble_gap_evt_disconnected(ble_gap_evt_t const *p_gap_evt) {
    m_conn_handle = BLE_CONN_HANDLE_INVALID;
    m_waiting_for_disconnect_evt = false;

    NRF_LOG_DEBUG("Disconnected: reason 0x%x.", p_gap_evt->params.disconnected.reason);

    if (m_app_initiated_disconnect == false) // (If a the app itself (button push) has initiated a disconnect, bsp_evt_handler will start the advertising.)
    {
        // Start advertising with the current setup.
        bsp_board_leds_off();
        set_current_adv_params_and_start_advertising();
    }
}

/**@brief Function for handling scan request report.
 * Print the RSSI and address of the initiator if the RSSI has changed.
 */
static void on_scan_req_report(ble_gap_evt_scan_req_report_t const *p_scan_req_report) {
    static int8_t rssi_value = 0;

    if (rssi_value != p_scan_req_report->rssi) {
    rssi_value = p_scan_req_report->rssi;
    NRF_LOG_INFO("Received scan request with RSSI %d .", rssi_value);
    NRF_LOG_INFO("addr %02x:%02x:%02x:%02x:%02x:%02x",
        p_scan_req_report->peer_addr.addr[0],
        p_scan_req_report->peer_addr.addr[1],
        p_scan_req_report->peer_addr.addr[2],
        p_scan_req_report->peer_addr.addr[3],
        p_scan_req_report->peer_addr.addr[4],
        p_scan_req_report->peer_addr.addr[5]);
    }
}

/**@brief Function for handling BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context) {
    uint32_t err_code;
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;
    ble_gap_conn_params_t params;

    switch (p_ble_evt->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED:
            on_ble_gap_evt_connected(p_gap_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_ble_gap_evt_disconnected(p_gap_evt);
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
            NRF_LOG_INFO("Connection interval updated: 0x%x, 0x%x.",
            p_gap_evt->params.conn_param_update.conn_params.min_conn_interval,
            p_gap_evt->params.conn_param_update.conn_params.max_conn_interval);
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            // Accept parameters requested by the peer.
            params = p_gap_evt->params.conn_param_update_request.conn_params;
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle, &params);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_INFO("Connection interval updated (upon request): 0x%x, 0x%x.",
            p_gap_evt->params.conn_param_update_request.conn_params.min_conn_interval,
            p_gap_evt->params.conn_param_update_request.conn_params.max_conn_interval);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            NRF_LOG_DEBUG("BLE_GATTS_EVT_SYS_ATTR_MISSING");
            err_code = sd_ble_gatts_sys_attr_set(p_gap_evt->conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT: // Fallthrough.
        case BLE_GATTS_EVT_TIMEOUT:
            NRF_LOG_DEBUG("GATT timeout, disconnecting.");
            err_code = sd_ble_gap_disconnect(m_conn_handle,
            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_PHY_UPDATE:
            NRF_LOG_DEBUG("BLE_GAP_EVT_PHY_UPDATE: not implemented.");
            break;

