chemary/nrf52_ble_long_range/peripheral_long_range_demo_kit/main.c
/**@brief Function for initializing GAP parameters.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name and the preferred connection parameters.
 */
static void gap_params_init(void) {
    ret_code_t err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode, (uint8_t const *)DEVICE_NAME, strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_ppcp_set(&m_conn_param);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT library. */

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
    ret_code_t ret;
    ret = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(ret);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void) {
    if (NRF_LOG_PROCESS() == false) {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for setting new output power selection: LEDs start to blink according to the selected state.
 * Note: this function sets the output power/TX power.
 *       The new output power will be set when (re-)starting to scan.
 */
static void output_power_selection_set(output_power_seclection_t output_power) {
    ret_code_t err_code;
    m_output_power_selected = output_power;
    switch (m_output_power_selected) {
        case SELECTION_8_dBm:
            // 8 dBm is the current output power, start blinking LED.
            bsp_board_led_off(OUTPUT_POWER_SELECTION_LED); // not necessary because the LED should start to blink.
            err_code = app_timer_start(m_8dBm_led_slow_blink_timer_id, SLOW_BLINK_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
        case SELECTION_0_dBm:
            // 0 dBm is the current output power, turn on LED.
            err_code = app_timer_stop(m_8dBm_led_slow_blink_timer_id);
            APP_ERROR_CHECK(err_code);
            bsp_board_led_on(OUTPUT_POWER_SELECTION_LED);
            break;
    }
}

/**@brief Function for switching output power/TX power: 0 dBm or 8 dBm.
 * Note:  this function does only set the internal state, it does apply the new setting.
 *        The new output power will be set when (re-)starting to scan.
 */
static void on_output_power_selection_button(void) {
    // Change the output power.
    output_power_seclection_t new_output_power;
    switch (m_output_power_selected) {
        case SELECTION_0_dBm: // 0 dBm is the previous output power.
            // 8 dBm is the current output power, start blinking LED.
            new_output_power = SELECTION_8_dBm;
            break;
        case SELECTION_8_dBm:
            // 0 dBm is the current output power, turn on LED.
            new_output_power = SELECTION_0_dBm;
            break;
    }
    output_power_selection_set(new_output_power);
}

/**@brief Function for setting new phy selection. LEDs start to blink according to the selected state.
 * Note: this function does only set the internal state, it does apply the new setting.
 *       The new phy will be be used when (re-)starting scanning.
 */
static void phy_selection_set_state(adv_scan_phy_seclection_t new_phy_selection) {
    ret_code_t err_code;
    m_adv_scan_phy_selected = new_phy_selection;

    switch (new_phy_selection) {
        case SELECTION_1M_PHY: // SELECTION_1M_PHY is the current "state".
            // 1 Mbps is the current state, LED should start blinking.
            err_code = app_timer_start(m_1Mbps_led_slow_blink_timer_id, SLOW_BLINK_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
        case SELECTION_CODED_PHY:
            // Coded phy is the current sate, turn on LED.
            err_code = app_timer_stop(m_1Mbps_led_slow_blink_timer_id);
            APP_ERROR_CHECK(err_code);
            bsp_board_led_on(PHY_SELECTION_LED);
            break;
    }
}

/**@brief Function for switching PHY: coded phy or 1 Mbps
 * Note: this function does only set the internal state, it does apply the new setting.
 *       The new phy will be be used when (re-)starting scanning.
 */
static void on_phy_selection_button(void) {
    // Change the selected phy.
    adv_scan_phy_seclection_t new_phy_selection;
    switch (m_adv_scan_phy_selected) {
        case SELECTION_CODED_PHY: // SELECTION_CODED_PHY is the previous "state".{
            // 1 Mbps is the current state, LED should start blinking.
            new_phy_selection = SELECTION_1M_PHY;
            break;
        case SELECTION_1M_PHY:
            // Coded phy is the current sate, turn on LED.
            new_phy_selection = SELECTION_CODED_PHY;
            break;
    }
    phy_selection_set_state(new_phy_selection);
}

/**@brief Function setting the internal advertising state.
 * Note: this function does only set the internal "advertising state", it does not start advertising.
 *       The new advertising mode will be used when (re-)starting to advertise.
 */
static void on_non_conn_or_conn_adv_selection_state_set(adv_scan_type_seclection_t adv_selection) {
    ret_code_t err_code;

    m_adv_scan_type_selected = adv_selection;
    bsp_board_led_off(CONN_ADV_CONN_STATE_LED);
    switch (adv_selection) {
        case SELECTION_NON_CONNECTABLE:
            // Current state is non-connectable advertising. Start blinking associated LED.
            err_code = app_timer_stop(m_conn_adv_fast_blink_timer_id);
            APP_ERROR_CHECK(err_code);
            bsp_board_led_off(CONN_ADV_CONN_STATE_LED);

            err_code = app_timer_start(m_non_conn_fast_blink_timer_id, FAST_BLINK_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
        case SELECTION_CONNECTABLE: 
            // Current state is connectable advertising. Start blinking associated LED.
            err_code = app_timer_stop(m_non_conn_fast_blink_timer_id);
            APP_ERROR_CHECK(err_code);
            bsp_board_led_off(NON_CONN_ADV_LED);

            err_code = app_timer_start(m_conn_adv_fast_blink_timer_id, FAST_BLINK_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
    }
}

