chemary/nrf52_ble_long_range/peripheral_long_range_demo_kit/main.c
/**@brief Function for switching between "non-connectable and connectable advertising" selection.
 * Note: this function does only set the internal "advertising state", it does not start advertising.
 *       The new advertising mode will be used when (re-)starting to advertise.
 */
static void on_non_conn_or_conn_adv_selection(void) {
    // Change the advertising type
    adv_scan_type_seclection_t new_adv_selection;

    switch (m_adv_scan_type_selected) {
        case SELECTION_CONNECTABLE: // Connectable advertising is the previous state.
            // Current state is non-connectable advertising. Start blinking associated LED.
            new_adv_selection = SELECTION_NON_CONNECTABLE;
            break;
        case SELECTION_NON_CONNECTABLE:
            // Current state is connectable advertising. Start blinking associated LED.
            new_adv_selection = SELECTION_CONNECTABLE;
            break;
    }
    on_non_conn_or_conn_adv_selection_state_set(new_adv_selection);
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
void bsp_evt_handler(bsp_event_t event) {
    ret_code_t err_code;

    if (event != BUTTON_NOT_IN_USE_EVENT) {
        // Set the correct parameters, depending on the button pushed.
        switch (event) {
            case PHY_SELECTION_BUTTON_EVENT:
                on_phy_selection_button();
                break;
            case OUTPUT_POWER_SELECTION_BUTTON_EVENT:
                on_output_power_selection_button();
                break;
            case NON_CONN_OR_CONN_ADV_BUTTON_EVENT:
                on_non_conn_or_conn_adv_selection();
                break;
            default:
                break;
        }

        disconnect_stop_adv();
        advertising_data_set();
        advertising_start();
    }
}

/**@brief Function for initializing buttons and leds.
 */
static void buttons_leds_init(void) {
    ret_code_t err_code;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_evt_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising with the current selections of output power, phy, and connectable or non-connectable advertising.
 */
static void set_current_adv_params_and_start_advertising(void) {

    phy_selection_set_state(m_adv_scan_phy_selected);
    on_non_conn_or_conn_adv_selection_state_set(m_adv_scan_type_selected);
    output_power_selection_set(m_output_power_selected);

    advertising_data_set();
    advertising_start();
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advdata_update(void) {
    ret_code_t ret;

    update_vbatt();

    ble_advdata_service_data_t service_data[2];

    service_data[0].service_uuid = BLE_UUID_BATTERY_SERVICE;
    service_data[0].data.size = sizeof(vbatt);
    service_data[0].data.p_data = (uint8_t *)&vbatt;

    service_data[1].service_uuid = BLE_UUID_HEALTH_THERMOMETER_SERVICE;
    service_data[1].data.size = sizeof(temp);
    service_data[1].data.p_data = (uint8_t *)&temp;

    ble_gap_adv_params_t adv_params = {
        .properties = {
            .type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED,
        },
        .p_peer_addr = NULL,
        .filter_policy = BLE_GAP_ADV_FP_ANY,
        .interval = ADV_INTERVAL,
        .duration = 0,

        .primary_phy = BLE_GAP_PHY_1MBPS, // Must be changed to connect in long range. (BLE_GAP_PHY_CODED)
        .secondary_phy = BLE_GAP_PHY_1MBPS,
        .scan_req_notification = 1,
    };

    ble_advdata_t const adv_data = {
        .name_type = BLE_ADVDATA_FULL_NAME,
        .flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
        .include_appearance = false,
        .service_data_count = 2,
        .p_service_data_array = service_data
    };

    m_adv_data.adv_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;

    // only extended advertising will allow primary phy to be coded
    adv_params.primary_phy = BLE_GAP_PHY_CODED;
    adv_params.secondary_phy = BLE_GAP_PHY_CODED;

    adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;

    ret = ble_advdata_encode(&adv_data, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(ret);

    ret = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(ret);
}

/**@brief Function for updating the VBATT field of TLM*/
static void update_vbatt(void) {
    uint16_t vbatt_tmp;              // Variable to hold voltage reading
    battery_voltage_get(&vbatt_tmp); // Get new battery voltage
    NRF_LOG_INFO("Voltage: %d", vbatt_tmp);
    vbatt[0] = (uint8_t)(vbatt_tmp >> 8);
    vbatt[1] = (uint8_t)vbatt_tmp;
}

static void update_vbatt_init(void) {
    uint32_t err_code;
    err_code = app_timer_start(m_battery_timer_id, SLOW_BLINK_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

int main(void) {
    // Initialize.
    log_init();

    timers_init();
    buttons_leds_init();

    power_management_init();
    ble_stack_init();
    gap_params_init();
    battery_voltage_init();

    // Start execution.
    NRF_LOG_INFO("Long range Tile started");
    set_current_adv_params_and_start_advertising();
    update_vbatt_init();

    // Enter main loop.
    for (;;) {
        idle_state_handle();
    }
}

/**
 * @}
 */